Былков_ДА_70180166/src/Documents/АкадемическаяНеуспеваемость/АкадемическаяНеуспеваемость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АкадемическаяНеуспеваемость</name>
  <registerRecords>AccumulationRegister.КонтрольАкадемическойНеуспеваемости</registerRecords>
  <attributes>
    <name>ИндексСтудента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикаСтудента</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаКонтроля</name>
      <type>
        <types>EnumRef.ФормаКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВозникновенияЗадолженности</name>
      <type>
        <types>EnumRef.ПричинаВозникновенияЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Былков_ДА_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильСтудента</name>
    <type>
      <types>CatalogRef.ПрофилиПодготовкиСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>EnumRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Былков_ДА_70180166/src/Documents/АкадемическаяНеуспеваемость/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ИндексСтудентаПриИзменении(Элемент)
	ПроверитьНаличиеДокументаДляСтудентаНаКлиенте(Объект.ИндексСтудента);
    	
	КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеДокументаДляСтудентаНаКлиенте(ИндексСтудента)
    Если Не ЗначениеЗаполнено(ИндексСтудента) Тогда
        Возврат;
    КонецЕсли;
    
    ЕстьДокумент = ЕстьПроведенныйДокументДляСтудентаНаСервере(ИндексСтудента);
    
    Если ЕстьДокумент Тогда  
        Объект.ИндексСтудента = Неопределено;
        ВызватьИсключение("Для данного студента уже существует проведенный документ 'Академическая неуспеваемость'!");
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьПроведенныйДокументДляСтудентаНаСервере(ИндексСтудента)
    Если Не ЗначениеЗаполнено(ИндексСтудента) Тогда
        Возврат Ложь;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    АкадемическаяНеуспеваемость.Ссылка
    |ИЗ
    |    Документ.АкадемическаяНеуспеваемость КАК АкадемическаяНеуспеваемость
    |ГДЕ
    |    АкадемическаяНеуспеваемость.ИндексСтудента = &ИндексСтудента
    |    И АкадемическаяНеуспеваемость.Проведен = Истина
    |    И АкадемическаяНеуспеваемость.Ссылка <> &ТекущийДокумент";
    
    Запрос.УстановитьПараметр("ИндексСтудента", ИндексСтудента);
    Запрос.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);
    Результат = Запрос.Выполнить();
    
    Возврат Результат.Выбрать().Следующий();
КонецФункции

&НаСервере
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    // Проверка уникальности индекса студента
    ПроверитьУникальностьИндексаСтудента(Отказ, Объект.ИндексСтудента, Объект.Ссылка);
    Если Отказ Тогда
        Возврат;
	КонецЕсли;
    
    // Проверка на существование проведенного документа для студента
    Если ЕстьПроведенныйДокументДляСтудентаНаСервере(Объект.ИндексСтудента) Тогда
        Отказ = Истина;
        ВызватьИсключение("Невозможно записать документ: для студента с индексом «" + 
                         Объект.ИндексСтудента + "» уже существует проведенный документ!");
        Возврат;
	КонецЕсли;
	
		  // Проверяем наличие записей в табличной части
    Если Элементы.ХарактеристикаСтудента.Количество() = 0 Тогда
            ВызватьИсключение ("У студента отсутствуют академические задолженности!");
    КонецЕсли;    
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСтудента(СсылкаНаСтудента)
    Если Не ЗначениеЗаполнено(СсылкаНаСтудента) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Студенты.ЛичныйИндекс КАК ЛичныйИндекс
    |ИЗ
    |   Справочник.Студенты КАК Студенты
    |ГДЕ
    |   Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
КонецФункции

&НаСервере
Процедура ПроверитьУникальностьИндексаСтудента(Отказ, ИндексСтудента, Ссылка)
    Если Не ЗначениеЗаполнено(ИндексСтудента) Тогда
        Отказ = Истина;
        ВызватьИсключение("Не указан индекс студента!");
        Возврат;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    АкадемическаяНеуспеваемость.Ссылка
    |ИЗ
    |    Документ.АкадемическаяНеуспеваемость КАК АкадемическаяНеуспеваемость
    |ГДЕ
    |    АкадемическаяНеуспеваемость.ИндексСтудента = &ИндексСтудента
    |    И АкадемическаяНеуспеваемость.Ссылка <> &Ссылка";
    
    Запрос.УстановитьПараметр("ИндексСтудента", ИндексСтудента);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Выбрать().Следующий() Тогда
        Отказ = Истина;
        ВызватьИсключение("Документ с таким индексом студента уже существует!");
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаСтудентаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	 // Запрещаем ручное добавление строк в табличную часть
    Отказ = Истина;
	ПоказатьПредупреждение(, "Добавление строк вручную запрещено! Строки заполняются автоматически через загрузку JSON-файла!");
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаСтудентаПередУдалением(Элемент, Отказ)
 // Запрещаем удаление строк из табличной части
    Отказ = Истина;
    ПоказатьПредупреждение(, "Удаление строк запрещено! Для изменения состава задолженностей заполните данные через JSON-файл!");
КонецПроцедуры
